Enterprise_Serivces/Prod/SilverGroup2/CSLTransactionService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/salestransactionservice/contracts/2010/05/ISalesTransactionService/ProcessSalesOrder</wsa:Action><wsa:MessageID>uuid:936d5daf-4247-404b-8a7d-406cca3a5b9c</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://csltransactionserviceqa1.testgs.pvt/TransactionService.svc</wsa:To></soap:Header><soap:Body><ProcessSalesOrder xmlns="http://www.gamestop.com/services/csl/salestransactionservice/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CountryCode xmlns="http://www.gamestop.com/services/core/contracts/2010/08">US</CountryCode><International xsi:nil="true" xmlns="http://www.gamestop.com/services/core/contracts/2010/08" /><SalesTransactionHeader xmlns="http://www.gamestop.com/services/csl/transaction/entities/2010/05"><BankDeposits xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><BusinessDate xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">2016-09-22T09:38:20.0540625-05:00</BusinessDate><CashierNumber xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">1234567</CashierNumber><ChannelType xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">PointOfSale</ChannelType><Currency xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">USD</Currency><Customer xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05"><Addresses xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><CustomerActivities xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><CustomerGuid xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><CustomerID xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05">1238349631</CustomerID><EdgeCardDiscountNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><EmailAddress xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><FirstName xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05">ab</FirstName><HomePhoneNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><Identifications xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><IssuedUser xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><LastName xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><LoyaltyInfo xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05"><LoyaltyCardNumber>3876000269233</LoyaltyCardNumber><Roles xsi:nil="true" /><Tier>0</Tier><TierExpirationDate>0001-01-01T00:00:00</TierExpirationDate></LoyaltyInfo><MembershipAttributes xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MembershipIds xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MembershipProgram xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MiddleName xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MobilePhoneNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><OpenId xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><Prefix xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><Suffix xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><Title xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><UserName xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><WorkPhoneNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /></Customer><DeviceName xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><DiscountCardNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><DiscountCardType xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">None</DiscountCardType><EBCCUsedForPayment xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">false</EBCCUsedForPayment><Employee xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05"><EmployeeInitials>INIT</EmployeeInitials><EmployeeNumber>1234567</EmployeeNumber></Employee><FSCardUsedForDiscount xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">false</FSCardUsedForDiscount><HardTotals xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><HopsGuid xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><InactiveTimeInSeconds xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">0</InactiveTimeInSeconds><IsPawnTransaction xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">false</IsPawnTransaction><LoyaltyID xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><MachineName xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">test</MachineName><NetCashAmount xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">15.59</NetCashAmount><NetNonCashAmount xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">0</NetNonCashAmount><NonMerchandiseTransaction xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">false</NonMerchandiseTransaction><NonSalesTimeInSeconds xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">0</NonSalesTimeInSeconds><NonTaxableTotal xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">0</NonTaxableTotal><NumberOfDetailRecords xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">0</NumberOfDetailRecords><OrderId xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><PartnerKey xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">TEST-US</PartnerKey><PostVoidReason xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><PurchasingEmployee xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><ReceiptEmailAddress xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">testcustomer@gstop.com</ReceiptEmailAddress><RegisterNumber xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">1</RegisterNumber><SalesTransactionHeaderGuid xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05">3d566c7a-2ffa-4008-a575-152a1317aa32</SalesTransactionHeaderGuid><SalesTransactionLineItems xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05"><SalesTransactionLineItem><AuditNumber xsi:nil="true" /><Category>345</Category><CommissionAmount>0</CommissionAmount><Customer><Addresses xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><CustomerActivities xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><CustomerGuid xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><CustomerID xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05">1238349631</CustomerID><EdgeCardDiscountNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><EmailAddress xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><FirstName xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05">ab</FirstName><HomePhoneNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><Identifications xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><IssuedUser xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><LastName xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><LoyaltyInfo xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MembershipAttributes xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MembershipIds xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MembershipProgram xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MiddleName xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><MobilePhoneNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><OpenId xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><Prefix xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><Suffix xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><Title xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><UserName xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /><WorkPhoneNumber xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/customer/2010/05" /></Customer><Discounts xsi:nil="true" /><FrequentCardNumber xsi:nil="true" /><HopsGuid xsi:nil="true" /><Return xsi:nil="true" /><ReturnNumber xsi:nil="true" /><SKU xsi:nil="true" /><SNOFDescription xsi:nil="true" /><SalesTransactionLineItemGuid>3d566c7a-2ffa-4008-a575-152a1317aa32</SalesTransactionLineItemGuid><SerialNumber xsi:nil="true" /><SubCategory xsi:nil="true" /></SalesTransactionLineItem></SalesTransactionLineItems><TaxExemptData xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><Tenders xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /><Total xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/sales/2010/05" /></SalesTransactionHeader></request></ProcessSalesOrder></soap:Body></soap:Envelope>